Update diagram.md
